#正则表达式
# \d可以匹配一个数字，
# \w可以匹配一个字母或数字 
# .可以匹配任意字符
# *表示任意个字符（包括0个），
# +表示至少一个字符，
# ?表示0个或1个字符，
# {n}表示n个字符，
# {n,m}表示n-m个字符：
# \s可以匹配一个空格（也包括Tab等空白符）
#[]表示范围,如：
# [0-9a-zA-Z\_]可以匹配一个数字、字母或者下划线；
# [0-9a-zA-Z\_]+可以匹配至少由一个数字、字母或者下划线组成的字符串，比如'a100'，'0_Z'，'Py3000'等等；
# [a-zA-Z\_][0-9a-zA-Z\_]*可以匹配由字母或下划线开头，后接任意个由一个数字、字母或者下划线组成的字符串，也就是Python合法的变量；
# [a-zA-Z\_][0-9a-zA-Z\_]{0, 19}更精确地限制了变量的长度是1-20个字符（前面1个字符+后面最多19个字符）。
# A|B可以匹配A或B，
# ^表示行的开头，^\d表示必须以数字开头。
# $表示行的结束，\d$表示必须以数字结束。
# 使用r前缀的Python字符串 避免转义符问题

import re
# s = 'ABC\\-001' # Python的字符串 存在转义符问题
# 因此我们强烈建议使用Python的r前缀，就不用考虑转义的问题了：
s = r'ABC\-001' # 使用r前缀的Python字符串

#match()方法判断是否匹配，如果匹配成功，返回一个Match对象，否则返回None。常见的判断方法就是：

if re.match(r'^\d{3}\-\d{3,8}$', '010-12345'):
    print('ok')
else:
    print('failed')
    
#切分字符串
print(re.split(r'\s+', 'a b   c'))  # 按空格切分
print(re.split(r'[\s\,]+', 'a,b, c  d'))  # 按空格或逗号切分    

# 分组
# 用()表示的就是要提取的分组（Group）
m = re.match(r'^(\d{3})-(\d{3,8})$', '010-12345')
print(m.group(0))  # 匹配的整个字符串   
print(m.group(1))  # 匹配的第一个分组（区号）
print(m.group(2))  # 匹配的第二个分组（本地号码）


# 贪婪匹配
# 正则匹配默认是贪婪匹配，也就是匹配尽可能多的字符
# 加个?就可以让\d+采用非贪婪匹配
reg = re.match(r'^(\d+?)(0*)$', '102300')
print(reg.group(1))  # 1023
print(reg.group(2))  # 00


# 预编译该正则表达式
re_tel = re.compile(r'^(\d{3})-(\d{3,8})$')
print(re_tel.match('010-12345').groups())  # ('010', '12345')
print(re_tel.match('010-8086').groups())  # ('010', '